clase05-20250520-clusterEscalabilidad/00-claseAnterior/04-ArtilleryRun/prueba.yml
config:
  # This is a test server run by team Artillery
  # It's designed to be highly scalable
  target: http://localhost:3000
  phases:
    - duration: 10
      arrivalRate: 5
      # rampTo: 5
      name: Fase I
    - duration: 10
      arrivalRate: 5
      rampTo: 20
      name: Fase II
    - duration: 10
      arrivalRate: 10
      rampTo: 5
      name: Fase III
  # Load & configure a couple of useful plugins
  # https://docs.art/reference/extensions
  # plugins:
  #   ensure: {}
  #   apdex: {}
  #   metrics-by-endpoint: {}
  # apdex:
  #   threshold: 100
  # ensure:
  #   thresholds:
  #     - http.response_time.p99: 100
  #     - http.response_time.p95: 75
scenarios:
  - name: "Sessions Flow (registro + login)"
    flow:
      - log: "Creamos las variables para el usuario de prueba"
      - get:
          url: "/usuario"
          capture:
            - json: "$.usuario.nombre"
              as: "nombre"
            - json: "$.usuario.apellido"
              as: "apellido"
            - json: "$.usuario.email"
              as: "email"
            - json: "$.usuario.password"
              as: "password"
      - log: "Registro de usuario {{nombre}} {{apellido}}"
      - post:
          url: "/api/sessions/registro"
          json:
            nombre: "{{nombre}}"
            apellido: "{{apellido}}"
            email: "{{email}}"
            password: "123"
      - think: 2
      - log: "Login {{email}}"
      - post:
          url: "/api/sessions/login"
          # headers:
          #   authorization: "Bearer {{ email }}"
          json:
            email: "{{email}}"
            # password: "{{password}}"
            password: "123"